### Reshaping Data â€“ Change layout, Sorting, Reindexing, Renaming

**df.pivot** :  To convert long-form data into wide-form data.

In [1]:
import pandas as pd

# Example DataFrame
df = pd.DataFrame({
    'date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
    'city': ['New York', 'Los Angeles', 'New York', 'Los Angeles'],
    'temperature': [30, 25, 28, 22]
})

In [2]:
# Using df.pivot to spread rows into columns
pivoted_df = df.pivot(index='date', columns='city', values='temperature')
pivoted_df

city        Los Angeles  New York
date
2023-01-01           25        30
2023-01-02           22        28

**pd.melt**: To convert a wide DataFrame into a long format.

In [3]:
# Example DataFrame
df = pd.DataFrame({
    'A': ['foo', 'bar'],
    'B': [1, 2],
    'C': [3, 4]
})
df

     A  B  C
0  foo  1  3
1  bar  2  4

In [4]:
# Using pd.melt to gather columns into rows
melted_df = pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])
melted_df

     A variable  value
0  foo        B      1
1  bar        B      2
2  foo        C      3
3  bar        C      4

**pd.concat**: Concatenates DataFrames along a particular axis (rows or columns).

In [5]:
#Example (Appending Rows):
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})

In [6]:
df1

   A  B
0  1  3
1  2  4

In [7]:
df2

   A  B
0  5  7
1  6  8

In [8]:
# Using pd.concat to append rows of DataFrames
combined_df = pd.concat([df1, df2])
combined_df

   A  B
0  1  3
1  2  4
0  5  7
1  6  8

In [9]:
# Example (Appending Columns):
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'C': [5, 6], 'D': [7, 8]})

In [10]:
df1

   A  B
0  1  3
1  2  4

In [11]:
df2

   C  D
0  5  7
1  6  8

In [12]:
# Using pd.concat to append columns of DataFrames
combined_df = pd.concat([df1, df2], axis=1)
combined_df

   A  B  C  D
0  1  3  5  7
1  2  4  6  8

**df.sort_values**: Sorts the DataFrame by the values of one or more columns.

In [13]:
df = pd.DataFrame({'mpg': [21, 22, 18, 24], 'model': ['A', 'B', 'C', 'D']})

# Using df.sort_values to order rows by 'mpg' (low to high)
sorted_df = df.sort_values('mpg')
sorted_df

   mpg model
2   18     C
0   21     A
1   22     B
3   24     D

In [14]:
# Using df.sort_values to order rows by 'mpg' (high to low)
sorted_df = df.sort_values('mpg', ascending=False)
sorted_df

   mpg model
3   24     D
1   22     B
0   21     A
2   18     C

**df.rename**: To change the names of columns or indices.

In [15]:
df = pd.DataFrame({'x': [1, 2, 3], 'y': [4, 5, 6]})

In [16]:
# Using df.rename to rename columns
renamed_df = df.rename(columns={'y': 'year'})
renamed_df

   x  year
0  1     4
1  2     5
2  3     6

**df.sort_index** : Sorts the DataFrame by its index.

In [17]:
df = pd.DataFrame({'A': [3, 2, 1]}, index=[2, 0, 1])
df

   A
2  3
0  2
1  1

In [18]:
# Using df.sort_index to sort the index
sorted_index_df = df.sort_index()
sorted_index_df

   A
0  2
1  1
2  3

**df.reset_index**: Resets the index of the DataFrame to the default integer index optionally moving the current index to columns.

In [19]:
df = pd.DataFrame({'A': [1, 2, 3]}, index=['a', 'b', 'c'])

In [20]:
df

   A
a  1
b  2
c  3

In [21]:
# Using df.reset_index to reset the index
reset_index_df = df.reset_index()
reset_index_df

  index  A
0     a  1
1     b  2
2     c  3

**df.drop** : Removes specified labels from rows or columns.

In [22]:
df = pd.DataFrame({'Length': [1, 2, 3], 'Width': [4, 5, 6], 'Height': [7, 8, 9]})

In [23]:
df

   Length  Width  Height
0       1      4       7
1       2      5       8
2       3      6       9

In [24]:
# Using df.drop to drop 'Length' column
df_dropped = df.drop(columns=['Length'])
df_dropped

   Width  Height
0      4       7
1      5       8
2      6       9